project/atropos-go/etcd_concurrent_read-master/master/e3/output/with_expensive_read/cheap_read.log
bench with linearizable range
 0 / 1000 B                                                                                                                                           !   0.00%INFO: 2023/06/09 16:24:05 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
INFO: 2023/06/09 16:24:05 balancerWrapper: got update addr from Notify: [{localhost:2379 <nil>}]
 1000 / 1000 Booooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooooo! 100.00% 9s

Summary:
  Total:	9.9918 secs.
  Slowest:	0.0094 secs.
  Fastest:	0.0002 secs.
  Average:	0.0005 secs.
  Stddev:	0.0009 secs.
  Requests/sec:	100.0824

Response time histogram:
  0.0002 [1]	|
  0.0011 [951]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.0020 [4]	|
  0.0030 [5]	|
  0.0039 [23]	|
  0.0048 [4]	|
  0.0057 [2]	|
  0.0067 [2]	|
  0.0076 [4]	|
  0.0085 [2]	|
  0.0094 [2]	|

Latency distribution:
  10% in 0.0003 secs.
  25% in 0.0003 secs.
  50% in 0.0003 secs.
  75% in 0.0004 secs.
  90% in 0.0006 secs.
  95% in 0.0010 secs.
  99% in 0.0061 secs.
  99.9% in 0.0094 secs.